Revit 2027 API
TableCellStyle.IsFontUnderline Property
 Gets or sets whether the text font is set to Underline of this cell.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsFontUnderline { get; set; }
Public Property IsFontUnderline As Boolean
	Get
	Set
public:
property bool IsFontUnderline {
	bool get ();
	void set (bool value);
}
member IsFontUnderline : bool with get, set
Property Value
Boolean
 true if the font is Underline; otherwise false.
See Also
Reference
TableCellStyle Class
Autodesk.Revit.DB Namespace